datomusic/duo-imxrt/brains2/core/lib/usb/usb_descriptors.c
#include "class/audio/audio.h"
#include "class/hid/hid_device.h"
#include "class/midi/midi.h"
#include "device/usbd.h"
#include "fsl_ocotp.h"
#include "tusb.h"
#include <stdio.h>

// Most of this file is based on the usb example included with tinyusb.

// Descriptor values specific to Dato and Duo.
#define DATO_VENDOR 0x16D0
#define DUO_PRODUCT_ID 0x10A7
#define DUO_PRODUCT_RELEASE_NUMBER 0x02

//--------------------------------------------------------------------+
// Device Descriptors
//--------------------------------------------------------------------+
tusb_desc_device_t const desc_device = {
    .bLength = sizeof(tusb_desc_device_t),
    .bDescriptorType = TUSB_DESC_DEVICE,
    .bcdUSB = 0x0200, // USB 2.0
    .bDeviceClass =
        0x00, // 0x00 means use device class from interface descriptors
    .bDeviceSubClass = 0x00, // Same as for device class
    .bDeviceProtocol = 0x00,
    .bMaxPacketSize0 = CFG_TUD_ENDPOINT0_SIZE,
    .idVendor = DATO_VENDOR,
    .idProduct = DUO_PRODUCT_ID,
    .bcdDevice = DUO_PRODUCT_RELEASE_NUMBER,

    .iManufacturer = 0x01,
    .iProduct = 0x02,
    .iSerialNumber = 0x03,

    .bNumConfigurations = 0x01};

// Invoked when received GET DEVICE DESCRIPTOR
// Application return pointer to descriptor
uint8_t const *tud_descriptor_device_cb(void) {
  return (uint8_t const *)&desc_device;
}

//--------------------------------------------------------------------+
// Configuration Descriptor
//--------------------------------------------------------------------+

enum {
  ITF_NUM_MIDI = 0,
  ITF_NUM_MIDI_STREAMING,
  ITF_NUM_TOTAL
};

#define CONFIG_TOTAL_LEN                                                       \
  (TUD_CONFIG_DESC_LEN + TUD_MIDI_DESC_LEN + TUD_HID_INOUT_DESC_LEN)

#define EPNUM_MIDI_OUT 0x01
#define EPNUM_MIDI_IN 0x01

// Config number, interface count, string index, total length, attribute,
// power in mA
#define CONF_DESCRIPTOR                                                        \
  TUD_CONFIG_DESCRIPTOR(1, ITF_NUM_TOTAL, 0, CONFIG_TOTAL_LEN, 0x00, 500)

// Interface number, string index, EP Out & EP In address, EP size
#define MIDI_DESCRIPTOR_FS                                                     \
  TUD_MIDI_DESCRIPTOR(ITF_NUM_MIDI, 0, EPNUM_MIDI_OUT, (0x80 | EPNUM_MIDI_IN), \
                      64)

#define MIDI_DESCRIPTOR_HS                                                     \
  TUD_MIDI_DESCRIPTOR(ITF_NUM_MIDI, 0, EPNUM_MIDI_OUT, (0x80 | EPNUM_MIDI_IN), \
                      512)

uint8_t const desc_hid_report[] = {
    TUD_HID_REPORT_DESC_GENERIC_INOUT(CFG_TUD_HID_EP_BUFSIZE)};

uint8_t const *tud_hid_descriptor_report_cb(uint8_t itf) {
  return desc_hid_report;
}

#define HID_DESCRIPTOR                                                         \
  TUD_HID_INOUT_DESCRIPTOR(ITF_NUM_HID, 2, HID_ITF_PROTOCOL_NONE,              \
                           sizeof(desc_hid_report), EPNUM_HID,                 \
                           0x80 | EPNUM_HID, CFG_TUD_HID_EP_BUFSIZE, 10)

uint8_t const desc_fs_configuration[] = {CONF_DESCRIPTOR, MIDI_DESCRIPTOR_FS};

#if TUD_OPT_HIGH_SPEED
uint8_t const desc_hs_configuration[] = {CONF_DESCRIPTOR, MIDI_DESCRIPTOR_HS};
#endif

// Invoked when received GET CONFIGURATION DESCRIPTOR
// Application return pointer to descriptor
// Descriptor contents must exist long enough for transfer to complete
uint8_t const *tud_descriptor_configuration_cb(uint8_t index) {
  (void)index; // for multiple configurations

#if TUD_OPT_HIGH_SPEED
  // Although we are highspeed, host may be fullspeed.
  return (tud_speed_get() == TUSB_SPEED_HIGH) ? desc_hs_configuration
                                              : desc_fs_configuration;
#else
  return desc_fs_configuration;
#endif
}

//--------------------------------------------------------------------+
// String Descriptors
//--------------------------------------------------------------------+

// array of pointer to string descriptors
char const *string_desc_arr[8] = {
    (const char[]){0x09, 0x04}, // 0: is supported language is English (0x0409)
    "Dato",                     // 1: Manufacturer
    "Dato DUO",                 // 2: Product
    NULL,                       // 3: Serial. Built upon request.
    GIT_TAG,
    GIT_BRANCH,
    GIT_HASH,
    DATO_BOARD};

#define DESC_STR_LEN 32
static uint16_t _desc_str[DESC_STR_LEN];

// Invoked when received GET STRING DESCRIPTOR request
// Application return pointer to descriptor, whose contents must exist long
// enough for transfer to complete
uint16_t const *tud_descriptor_string_cb(uint8_t index, uint16_t langid) {
  (void)langid;

  uint8_t chr_count;

  if (index == 0) {
    memcpy(&_desc_str[1], string_desc_arr[0], 2);
    chr_count = 1;
  } else if (index == 3) {
    // Build unique serial string.
    const uint32_t ID_0 = OCOTP->CFG0;
    const uint32_t ID_1 = OCOTP->CFG1;
    char tmp_serial[32];
    chr_count = snprintf(tmp_serial, sizeof(tmp_serial), "%li-%li", ID_0, ID_1);
    if (chr_count > DESC_STR_LEN - 1) {
      chr_count = DESC_STR_LEN - 1;
    }

    for (uint8_t i = 0; i < chr_count; i++) {
      _desc_str[1 + i] = tmp_serial[i];
    }

  } else {
    // Note: the 0xEE index string is a Microsoft OS 1.0 Descriptors.
    // https://docs.microsoft.com/en-us/windows-hardware/drivers/usbcon/microsoft-defined-usb-descriptors

    if (!(index < sizeof(string_desc_arr) / sizeof(string_desc_arr[0])))
      return NULL;

    const char *str = string_desc_arr[index];

    // Cap at max char
    chr_count = strlen(str);
    if (chr_count > DESC_STR_LEN - 1)
      chr_count = DESC_STR_LEN - 1;

    // Convert ASCII string into UTF-16
    for (uint8_t i = 0; i < chr_count; i++) {
      _desc_str[1 + i] = str[i];
    }
  }

  // first byte is length (including header), second byte is string type
  _desc_str[0] = (TUSB_DESC_STRING << 8) | (2 * chr_count + 2);

  return _desc_str;
}
